1)
//написать все три вида переменных
let name = 'Угур'
let fullName = 'Мадинали Угур'
let birthday = '17 Август'

2)
//создать 2 переменные а,b задать им 4,5 а потом сложить и вывести в консоли
let a = 4
let b = 5
console.log(a + b)

3)
//какие знаки можно использовать во время создания переменных
$ _

4)
//найди неправильную переменную
//let a;
//let 3abc = 45;
//let nre4 = 35;
let a;

5)
//найди неправильную переменную
//let answer = 0;
//let alert = 45;
//let errorMessage = 456;
let errorMessage = 456;

6) 
//укоротите выражение ниже
let a = 10;
a = a + 5;
console.log(a); //15

7)
//что выведет переменная let a;
//null
//ничего
//undefined
ничего

8) 
//укоротите скрипт ниже


9)
//что выведет консоль
let a = 6;
{
    let a = 7;
}
console.log(a);

let a = 6;

10)
//что выведет консоль
let a = 6;
{
    let a = 7;
    console.log(a);
}
let a = 7;

11)
//что выведет консоль
let a = 6;
{
    console.log(a);
}
ничего

12)
//что выведет консоль
const a = 6;
a = 7;
console.log(a);
a = 7;

13)
//измените константу чтобы она вывела в консоли [1, 2, 6, 4]
const arr = [1, 2, 3, 4];
const arr = [1, 2, 6, 4];

14)
//возвести 2 в степень 4 и вывести в консоли

15)
//выведите в консоли остаток от деления 5 на 4

16)
//укажите знак равно
//=
//==
//===
=

17) 
//укажите строгое равно
//=
//==
//===
===

18)
//Напишите все логические операторы
*, /, +, -, =